CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PORT_DFER_DFE_1_MASK 0x02u /*!<@brief Digital Filter Enable Mask for item 1. */
#define PORT_DFER_DFE_2_MASK 0x04u /*!<@brief Digital Filter Enable Mask for item 2. */

/*! @name PORTE8 (number 11), SD_DTK
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_SD_DTK_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define GPIO_SD_DTK_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_SD_DTK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define GPIO_SD_DTK_PIN 8U                   /*!<@brief PORT pin number */
#define GPIO_SD_DTK_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE26 (number 47), TOF0_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_TOF0_INT_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define GPIO_TOF0_INT_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_TOF0_INT_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define GPIO_TOF0_INT_PIN 26U                   /*!<@brief PORT pin number */
#define GPIO_TOF0_INT_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTE27 (number 48), TOF0_XHT
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_TOF0_XHT_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define GPIO_TOF0_XHT_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_TOF0_XHT_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define GPIO_TOF0_XHT_PIN 27U                   /*!<@brief PORT pin number */
#define GPIO_TOF0_XHT_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTE28 (number 49), TOF1_INT
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_TOF1_INT_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define GPIO_TOF1_INT_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_TOF1_INT_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define GPIO_TOF1_INT_PIN 28U                   /*!<@brief PORT pin number */
#define GPIO_TOF1_INT_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTA4 (number 54), TOF_XHT
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_TOF1_XHT_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define GPIO_TOF1_XHT_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_TOF1_XHT_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define GPIO_TOF1_XHT_PIN 4U                   /*!<@brief PORT pin number */
#define GPIO_TOF1_XHT_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA10 (number 62), OLED_D_C
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_OLED_RST_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define GPIO_OLED_RST_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_OLED_RST_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define GPIO_OLED_RST_PIN 10U                   /*!<@brief PORT pin number */
#define GPIO_OLED_RST_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTA11 (number 63), OLED_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_OLED_D_C_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define GPIO_OLED_D_C_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_OLED_D_C_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define GPIO_OLED_D_C_PIN 11U                   /*!<@brief PORT pin number */
#define GPIO_OLED_D_C_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC4 (number 109), KEY_BTUP
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_KEY_BTUP_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_BTUP_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_BTUP_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_BTUP_PIN 4U                   /*!<@brief PORT pin number */
#define GPIO_KEY_BTUP_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC5 (number 110), KEY_BTDN
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_KEY_BTRT_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_BTRT_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_BTRT_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_BTRT_PIN 5U                   /*!<@brief PORT pin number */
#define GPIO_KEY_BTRT_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC6 (number 111), KEY_BTLF
  @{ */

