CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define GPIO_KEY_BTDN_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_BTDN_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_BTDN_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_BTDN_PIN 6U                   /*!<@brief PORT pin number */
#define GPIO_KEY_BTDN_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC7 (number 112), KEY_BTLF
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_KEY_BTLF_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_BTLF_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_BTLF_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_BTLF_PIN 7U                   /*!<@brief PORT pin number */
#define GPIO_KEY_BTLF_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC8 (number 113), KEY_BTOK
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_KEY_BTOK_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_BTOK_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_BTOK_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_BTOK_PIN 8U                   /*!<@brief PORT pin number */
#define GPIO_KEY_BTOK_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC12 (number 117), KEY_SW00
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_KEY_SW01_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_SW01_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_SW01_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_SW01_PIN 12U                   /*!<@brief PORT pin number */
#define GPIO_KEY_SW01_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC13 (number 118), KEY_SW02
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_KEY_SW02_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_SW02_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_SW02_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_SW02_PIN 13U                   /*!<@brief PORT pin number */
#define GPIO_KEY_SW02_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC14 (number 119), KEY_SW03
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_KEY_SW03_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_SW03_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_SW03_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_SW03_PIN 14U                   /*!<@brief PORT pin number */
#define GPIO_KEY_SW03_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTC15 (number 120), KEY_SW04
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_KEY_SW04_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define GPIO_KEY_SW04_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_KEY_SW04_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define GPIO_KEY_SW04_PIN 15U                   /*!<@brief PORT pin number */
#define GPIO_KEY_SW04_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTD4 (number 131), CAM_PCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_PCLK_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_PCLK_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_PCLK_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_PCLK_PIN 4U                   /*!<@brief PORT pin number */
#define GPIO_CAM_PCLK_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTD5 (number 132), CAM_VSNC
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_VSNC_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_VSNC_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_VSNC_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_VSNC_PIN 5U                   /*!<@brief PORT pin number */
#define GPIO_CAM_VSNC_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTD8 (number 137), CAM_D0
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_D0_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_D0_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_D0_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_D0_PIN 8U                   /*!<@brief PORT pin number */
#define GPIO_CAM_D0_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD9 (number 138), CAM_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_D1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_D1_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_D1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_D1_PIN 9U                   /*!<@brief PORT pin number */
#define GPIO_CAM_D1_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD10 (number 139), CAM_D2
  @{ */

