CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define GPIO_CAM_D2_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_D2_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_D2_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_D2_PIN 10U                   /*!<@brief PORT pin number */
#define GPIO_CAM_D2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD11 (number 140), CAM_D3
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_D3_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_D3_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_D3_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_D3_PIN 11U                   /*!<@brief PORT pin number */
#define GPIO_CAM_D3_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD12 (number 141), CAM_d3
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_D4_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_D4_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_D4_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_D4_PIN 12U                   /*!<@brief PORT pin number */
#define GPIO_CAM_D4_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD13 (number 142), CAM_D5
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_D5_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_D5_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_D5_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_D5_PIN 13U                   /*!<@brief PORT pin number */
#define GPIO_CAM_D5_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD14 (number 143), CAM_D6
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_D6_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_D6_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_D6_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_D6_PIN 14U                   /*!<@brief PORT pin number */
#define GPIO_CAM_D6_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD15 (number 144), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_CAM_D7_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define GPIO_CAM_D7_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_CAM_D7_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define GPIO_CAM_D7_PIN 15U                   /*!<@brief PORT pin number */
#define GPIO_CAM_D7_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD7 (number 136), RSV_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_RSV_D7_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define GPIO_RSV_D7_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_RSV_D7_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define GPIO_RSV_D7_PIN 7U                   /*!<@brief PORT pin number */
#define GPIO_RSV_D7_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD6 (number 133), RSV_D6
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_RSV_D6_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define GPIO_RSV_D6_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_RSV_D6_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define GPIO_RSV_D6_PIN 6U                   /*!<@brief PORT pin number */
#define GPIO_RSV_D6_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD2 (number 129), RSV_D2
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_RSV_D2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define GPIO_RSV_D2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_RSV_D2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define GPIO_RSV_D2_PIN 2U                   /*!<@brief PORT pin number */
#define GPIO_RSV_D2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD1 (number 128), RSV_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define GPIO_RSV_D1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define GPIO_RSV_D1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define GPIO_RSV_D1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define GPIO_RSV_D1_PIN 1U                   /*!<@brief PORT pin number */
#define GPIO_RSV_D1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void gpio(void);

/*! @name PORTA12 (number 64), IMU_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define I2C_IMU_SCL_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define I2C_IMU_SCL_PIN 12U                   /*!<@brief PORT pin number */
#define I2C_IMU_SCL_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTA13 (number 65), IMU_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define I2C_IMU_SDA_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define I2C_IMU_SDA_PIN 13U                   /*!<@brief PORT pin number */
#define I2C_IMU_SDA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTE24 (number 45), TOF_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define I2C_TOF_SCL_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define I2C_TOF_SCL_PIN 24U                   /*!<@brief PORT pin number */
#define I2C_TOF_SCL_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                              /* @} */

