CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/*! @name PORTE25 (number 46), TOF_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define I2C_TOF_SDA_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define I2C_TOF_SDA_PIN 25U                   /*!<@brief PORT pin number */
#define I2C_TOF_SDA_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void i2c(void);

/*! @name PORTA14 (number 66), OLED_PCS
  @{ */

/* Symbols to be used with PORT driver */
#define SPI_OLED_PCS_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define SPI_OLED_PCS_PIN 14U                   /*!<@brief PORT pin number */
#define SPI_OLED_PCS_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA15 (number 67), OLED_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define SPI_OLED_SCK_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define SPI_OLED_SCK_PIN 15U                   /*!<@brief PORT pin number */
#define SPI_OLED_SCK_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA16 (number 68), OLED_SOT
  @{ */

/* Symbols to be used with PORT driver */
#define SPI_OLED_SOT_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define SPI_OLED_SOT_PIN 16U                   /*!<@brief PORT pin number */
#define SPI_OLED_SOT_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void spi(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTC16 (number 123), CAM_RX
  @{ */

/* Symbols to be used with PORT driver */
#define UART_CAM_RX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define UART_CAM_RX_PIN 16U                   /*!<@brief PORT pin number */
#define UART_CAM_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC17 (number 124), CAM_TX
  @{ */

/* Symbols to be used with PORT driver */
#define UART_CAM_TX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define UART_CAM_TX_PIN 17U                   /*!<@brief PORT pin number */
#define UART_CAM_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB16 (number 95), COM_RX
  @{ */

/* Symbols to be used with PORT driver */
#define UART_COM_RX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define UART_COM_RX_PIN 16U                   /*!<@brief PORT pin number */
#define UART_COM_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB17 (number 96), COM_TX
  @{ */

/* Symbols to be used with PORT driver */
#define UART_COM_TX_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define UART_COM_TX_PIN 17U                   /*!<@brief PORT pin number */
#define UART_COM_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void uart(void);

/*! @name PORTE6 (number 9), CLEDL_B
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_CLEDL_B_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define FTM_CLEDL_B_PIN 6U                   /*!<@brief PORT pin number */
#define FTM_CLEDL_B_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE7 (number 10), CLEDL_G
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_CLEDL_G_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define FTM_CLEDL_G_PIN 7U                   /*!<@brief PORT pin number */
#define FTM_CLEDL_G_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE9 (number 12), CLEDL_R
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_CLEDL_R_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define FTM_CLEDL_R_PIN 9U                   /*!<@brief PORT pin number */
#define FTM_CLEDL_R_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC9 (number 114), CLEDR_B
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_CLEDR_B_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define FTM_CLEDR_B_PIN 9U                   /*!<@brief PORT pin number */
#define FTM_CLEDR_B_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC10 (number 115), CLEDR_G
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_CLEDR_G_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define FTM_CLEDR_G_PIN 10U                   /*!<@brief PORT pin number */
#define FTM_CLEDR_G_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC11 (number 116), CLEDR_R
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_CLEDR_R_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define FTM_CLEDR_R_PIN 11U                   /*!<@brief PORT pin number */
#define FTM_CLEDR_R_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTD0 (number 127), SERVO_F
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_SERVO_F_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define FTM_SERVO_F_PIN 0U                   /*!<@brief PORT pin number */
#define FTM_SERVO_F_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD3 (number 130), SERVO_B
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_SERVO_B_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define FTM_SERVO_B_PIN 3U                   /*!<@brief PORT pin number */
#define FTM_SERVO_B_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC1 (number 104), MOTOR_LA
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_MOTOR_LA_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define FTM_MOTOR_LA_PIN 1U                   /*!<@brief PORT pin number */
#define FTM_MOTOR_LA_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC2 (number 105), MOTOR_LB
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_MOTOR_LB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define FTM_MOTOR_LB_PIN 2U                   /*!<@brief PORT pin number */
#define FTM_MOTOR_LB_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

