CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/*! @name PORTA5 (number 55), MOTOR_RA
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_MOTOR_RA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define FTM_MOTOR_RA_PIN 5U                   /*!<@brief PORT pin number */
#define FTM_MOTOR_RA_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTA6 (number 58), MOTOR_RB
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_MOTOR_RB_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define FTM_MOTOR_RB_PIN 6U                   /*!<@brief PORT pin number */
#define FTM_MOTOR_RB_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTA8 (number 60), ENCO_LA
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_ENCO_LA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define FTM_ENCO_LA_PIN 8U                   /*!<@brief PORT pin number */
#define FTM_ENCO_LA_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTA9 (number 61), ENCO_LB
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_ENCO_LB_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define FTM_ENCO_LB_PIN 9U                   /*!<@brief PORT pin number */
#define FTM_ENCO_LB_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB18 (number 97), ENCO_RA
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_ENCO_RA_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define FTM_ENCO_RA_PIN 18U                   /*!<@brief PORT pin number */
#define FTM_ENCO_RA_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTB19 (number 98), ENCO_RB
  @{ */

/* Symbols to be used with PORT driver */
#define FTM_ENCO_RB_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define FTM_ENCO_RB_PIN 19U                   /*!<@brief PORT pin number */
#define FTM_ENCO_RB_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ftm(void);

/*! @name PORTC0 (number 103), MOTOR_IL
  @{ */

/* Symbols to be used with PORT driver */
#define ADC_MOTOR_IL_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define ADC_MOTOR_IL_PIN 0U                   /*!<@brief PORT pin number */
#define ADC_MOTOR_IL_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTA7 (number 59), MOTOR_IR
  @{ */

/* Symbols to be used with PORT driver */
#define ADC_MOTOR_IR_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define ADC_MOTOR_IR_PIN 7U                   /*!<@brief PORT pin number */
#define ADC_MOTOR_IR_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name ADC0_SE23 (number 38), VOLT_3V3
  @{ */
/* @} */

/*! @name ADC1_SE23 (number 39), VOLT_7V2
  @{ */
/* @} */

/*! @name PORTB2 (number 83), MAG_YL
  @{ */

/* Symbols to be used with PORT driver */
#define ADC_MAG_YL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define ADC_MAG_YL_PIN 2U                   /*!<@brief PORT pin number */
#define ADC_MAG_YL_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB3 (number 84), MAG_YR
  @{ */

/* Symbols to be used with PORT driver */
#define ADC_MAG_YR_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define ADC_MAG_YR_PIN 3U                   /*!<@brief PORT pin number */
#define ADC_MAG_YR_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB0 (number 81), MAG_XL
  @{ */

/* Symbols to be used with PORT driver */
#define ADC_MAG_XL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define ADC_MAG_XL_PIN 0U                   /*!<@brief PORT pin number */
#define ADC_MAG_XL_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB1 (number 82), MAG_XR
  @{ */

/* Symbols to be used with PORT driver */
#define ADC_MAG_XR_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define ADC_MAG_XR_PIN 1U                   /*!<@brief PORT pin number */
#define ADC_MAG_XR_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void adc(void);

/*! @name PORTE1 (number 2), SD_D0
  @{ */

/* Symbols to be used with PORT driver */
#define SDHC_SD_D0_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SDHC_SD_D0_PIN 1U                   /*!<@brief PORT pin number */
#define SDHC_SD_D0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE0 (number 1), SD_D1
  @{ */

/* Symbols to be used with PORT driver */
#define SDHC_SD_D1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SDHC_SD_D1_PIN 0U                   /*!<@brief PORT pin number */
#define SDHC_SD_D1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE5 (number 8), SD_D2
  @{ */

/* Symbols to be used with PORT driver */
#define SDHC_SD_D2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SDHC_SD_D2_PIN 5U                   /*!<@brief PORT pin number */
#define SDHC_SD_D2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE4 (number 7), SD_D3
  @{ */

/* Symbols to be used with PORT driver */
#define SDHC_SD_D3_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SDHC_SD_D3_PIN 4U                   /*!<@brief PORT pin number */
#define SDHC_SD_D3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE3 (number 4), SD_CMD
  @{ */

/* Symbols to be used with PORT driver */
#define SDHC_SD_CMD_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SDHC_SD_CMD_PIN 3U                   /*!<@brief PORT pin number */
#define SDHC_SD_CMD_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE2 (number 3), SD_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define SDHC_SD_CLK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SDHC_SD_CLK_PIN 2U                   /*!<@brief PORT pin number */
#define SDHC_SD_CLK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void sdhc(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void sys(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
